In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pandas import Series, DataFrame

In [2]:
%matplotlib inline

In [3]:
obj = Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [4]:
index = obj.index
index, id(index), id(obj.index)

(Index(['a', 'b', 'c'], dtype='object'), 4628913288, 4628913288)

In [5]:
index[1:]

Index(['b', 'c'], dtype='object')

In [6]:
# index[1] = 'd'
# 对index 重新赋值，而不是修改obj.index
# index = [1, 2, 3]
obj.index, index

(Index(['a', 'b', 'c'], dtype='object'),
 Index(['a', 'b', 'c'], dtype='object'))

In [7]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [8]:
obj2 = Series([1.5, -2.5, 0], index=index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [9]:
obj2.index is index

True

#### reindex

In [10]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['a', 'b', 'c', 'd'])
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [11]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a    4.5
b    7.2
c   -5.3
d    3.6
e    NaN
dtype: float64

In [12]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)
obj2

a    4.5
b    7.2
c   -5.3
d    3.6
e    0.0
dtype: float64

In [13]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [14]:
#front fill
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [15]:
frame = DataFrame(
    np.arange(9).reshape((3, 3)), 
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California']
)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [16]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [17]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [18]:
frame2 = frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill')
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [19]:
# frame2.reindex(columns=states, method='ffill')

In [20]:
obj = Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [21]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [22]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int64

In [23]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
data.drop(['two'], axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [26]:
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [27]:
obj['b']

1

In [28]:
obj[1]

1

In [29]:
obj[2:4]

c    2
d    3
dtype: int64

In [30]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: int64

In [31]:
obj[[1, 3]]

b    1
d    3
dtype: int64

In [32]:
obj[obj<2]

a    0
b    1
dtype: int64

In [33]:
obj['b':'c'] = 5 
obj

a    0
b    5
c    5
d    3
dtype: int64

In [34]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [36]:
data[['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [37]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [38]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data['three']>5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [41]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [42]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [44]:
data.ix[2]

/Users/apple/.virtualenvs/math3.5/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [45]:
data.ix[data.three > 5, :4]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
data.three > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [47]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [48]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [49]:
df1 = DataFrame(np.arange(9).reshape((3, 3)), columns=list('bcd'),
               index=['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [50]:
df2 = DataFrame(np.arange(12).reshape((4, 3)), columns=list('bde'),
               index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [51]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [52]:
df1 = DataFrame(np.arange(12).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20).reshape((4, 5)), columns=list('abcde'))

In [53]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [54]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [55]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [56]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [57]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [58]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [59]:
# 每一行与第一行的数据差值.
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [60]:
frame = DataFrame(np.arange(12).reshape((4, 3)), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [61]:
s = frame.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int64

In [62]:
frame - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [63]:
s2 = Series(range(3), index=['b', 'e', 'f'])
s2

b    0
e    1
f    2
dtype: int64

In [64]:
frame + s2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [65]:
s3 = frame['d']
s3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int64

In [66]:
# 沿着列传播
frame.sub(s3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [67]:
frame = DataFrame(np.random.randn(4, 3), 
                 columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.075520 -0.773675 -1.473478
Ohio    1.145611 -2.207601  1.338245
Texas  -0.316227  2.899595  2.358875
Oregon -1.834546  0.601149 -0.018167

In [68]:
np.abs(frame)

               b         d         e
Utah    1.075520  0.773675  1.473478
Ohio    1.145611  2.207601  1.338245
Texas   0.316227  2.899595  2.358875
Oregon  1.834546  0.601149  0.018167

In [69]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.980157
d    5.107196
e    3.832353
dtype: float64

In [70]:
def f(x):
    return Series([x.min(), x.max(), x.max() - x.min()], index=['min', 'max', 'diff'])
frame.apply(f)

             b         d         e
min  -1.834546 -2.207601 -1.473478
max   1.145611  2.899595  2.358875
diff  2.980157  5.107196  3.832353

In [71]:
f = lambda x: '%.2f' % x
frame.applymap(f)

            b      d      e
Utah     1.08  -0.77  -1.47
Ohio     1.15  -2.21   1.34
Texas   -0.32   2.90   2.36
Oregon  -1.83   0.60  -0.02

In [72]:
frame['e'].map(f)

Utah      -1.47
Ohio       1.34
Texas      2.36
Oregon    -0.02
Name: e, dtype: object

#### 排序和排名

In [73]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [74]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], 
                 columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [75]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [76]:
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [77]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [78]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [79]:
# nan 默认都会放到最好面S
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [80]:
frame = DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [81]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [82]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

##### rank

In [83]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [84]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [85]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 
                   'a':[0, 1, 0, 1],
                    'c':[-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [86]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [87]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [88]:
obj.index.is_unique

False

In [32]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.182637  0.311761 -1.013926
a  0.257114 -0.641228  1.557036
b  0.148119 -1.480819  0.056597
b -0.225801 -0.438839  0.520202

In [34]:
df.loc['b']

          0         1         2
b  0.148119 -1.480819  0.056597
b -0.225801 -0.438839  0.520202

In [89]:
def singleNumber(arr=None):
    if not arr:
        return None
    num = 0
    for i in arr:
        num ^= i
    return num
singleNumber([2, 3, 2, 1, 5, 1, 3]), singleNumber([2, 3, 2, 1, 3])

(5, 1)

In [39]:
2^3^2^5^5

3

#### 汇总

In [90]:
df = DataFrame([[1.4, np.nan], 
                [7.1, -4], 
                [np.nan, np.nan], 
                [0.75, -1.3]], 
              index=['a', 'b', 'c', 'd'], 
              columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.0
c   NaN  NaN
d  0.75 -1.3

In [91]:
df.sum()

one    9.25
two   -5.30
dtype: float64

In [92]:
df.sum(axis=1)

a    1.40
b    3.10
c     NaN
d   -0.55
dtype: float64

In [93]:
df.sum(axis=1, skipna=False)

a     NaN
b    3.10
c     NaN
d   -0.55
dtype: float64

In [94]:
df.idxmax()

one    b
two    d
dtype: object

In [95]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.650000
std    3.493685  1.909188
min    0.750000 -4.000000
25%    1.075000 -3.325000
50%    1.400000 -2.650000
75%    4.250000 -1.975000
max    7.100000 -1.300000

In [96]:
obj = Series(['a', 'a', 'c'])
obj.describe()

count     3
unique    2
top       a
freq      2
dtype: object

In [102]:
pd.io.

ImportError: cannot import name 'pandas_datareader'

In [103]:
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [104]:
pd.value_counts(data)

TypeError: Argument 'obj' has incorrect type (expected list, got DataFrame)

In [107]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [108]:
string_data = Series(['aa', 'b', np.nan, 'cc'])
string_data

0     aa
1      b
2    NaN
3     cc
dtype: object

In [109]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [110]:
from numpy import nan as NA

In [111]:
data = Series([1, NA, 2, NA, 7])

In [112]:
data.dropna()

0    1.0
2    2.0
4    7.0
dtype: float64